# 연산자 연습(산술 연산)
# 덧셈 및 곱셈같은 연산 

# 줄리아는 계산기와 같이 편하게 연산을 수행할 수 있다는 느낌이 든다. 그리고 무엇보다도 간결하다.

# julia> 40 + 2 (실제로는 앞에 julia>가 나타난다. 그리고 입력값을 주면 출력값을 준다)

# julia> 43 - 1

---------------------------------------------------------------------------------------------------
# Code

40 + 2    # 덧셈 (addition)

43 - 1    # 뺄셈 (subtraction)
 
6 * 7     # 곱셈 (mulitiplication)

84 / 2    # 나누기 (division)

6^2 + 6   # 주어진 수를 주어진 횟수만큼 곱하는 연산(거듭제곱 ^ 수행)  (exponential function)

---------------------------------------------------------------------------------------------------

# Python과의 차이점

# Python에서는 **로 Exponent를 표현
# ex) a**b =10 to the power 20
